Autodesk.Revit.DB.MullionTypeSet
A set that contains mullion types.

Autodesk.Revit.DB.MullionTypeSet.Insert(Autodesk.Revit.DB.MullionType)
System.Int32
Insert the specified mullion type into the set.
item: The mullion type to be inserted into the set.
Returns: Returns whether the mullion type was inserted into the set.

Autodesk.Revit.DB.MullionTypeSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.MullionTypeSet.ReverseIterator
Autodesk.Revit.DB.MullionTypeSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.MullionTypeSet.ForwardIterator
Autodesk.Revit.DB.MullionTypeSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.MullionTypeSet.Erase(Autodesk.Revit.DB.MullionType)
System.Int32
Removes a specified mullion type from the set.
item: The mullion type to be erased.
Returns: The number of mullion types that were erased from the set.

Autodesk.Revit.DB.MullionTypeSet.Contains(Autodesk.Revit.DB.MullionType)
System.Boolean
Tests for the existence of a mullion type within the set.
item: The mullion type to be searched for.
Returns: The Contains method returns True if the mullion type is within the set, otherwise False.

Autodesk.Revit.DB.MullionTypeSet.Clear
void
Removes every mullion type from the set, rendering it empty.

Autodesk.Revit.DB.MullionTypeSet.Size
System.Int32
get
Returns the number of mullion types that are in the set.

Autodesk.Revit.DB.MullionTypeSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.